In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[['OdName','AreaName',1980,1981]]
df_new = df_new.head()
df_new.loc[5] = ["Andorra", "North America", 50, 60]  #Inserting a New ROW
df_OdName = df_new.set_index('OdName')

# LOC : Search will be done only by Index Value

#### If ROW Index found only once It will return a Series

In [4]:
df_new

           OdName       AreaName  1980  1981
0     Afghanistan           Asia    16    39
1         Albania         Europe     1     0
2         Algeria         Africa    80    67
3  American Samoa        Oceania     0     1
4         Andorra         Europe     0     0
5         Andorra  North America    50    60

In [5]:
df_new.loc[2]   #Return a Series

OdName      Algeria
AreaName     Africa
1980             80
1981             67
Name: 2, dtype: object

In [6]:
df_new.loc[2].values.tolist()

['Algeria', 'Africa', 80, 67]

In [7]:
df_OdName

                     AreaName  1980  1981
OdName
Afghanistan              Asia    16    39
Albania                Europe     1     0
Algeria                Africa    80    67
American Samoa        Oceania     0     1
Andorra                Europe     0     0
Andorra         North America    50    60

In [8]:
df_OdName.loc["Algeria"]  #Return a Series

AreaName    Africa
1980            80
1981            67
Name: Algeria, dtype: object

In [9]:
df_OdName.loc["Algeria"].values.tolist()

['Africa', 80, 67]

#### If ROW Index found more than Once it will return a DataFrame

In [10]:
df_OdName

                     AreaName  1980  1981
OdName
Afghanistan              Asia    16    39
Albania                Europe     1     0
Algeria                Africa    80    67
American Samoa        Oceania     0     1
Andorra                Europe     0     0
Andorra         North America    50    60

In [11]:
df_OdName.loc["Andorra"]

              AreaName  1980  1981
OdName
Andorra         Europe     0     0
Andorra  North America    50    60

In [13]:
df_OdName.loc["Andorra"].values.tolist()

[['Europe', 0, 0], ['North America', 50, 60]]

#### Search Multiple ROWs

In [14]:
df_OdName

                     AreaName  1980  1981
OdName
Afghanistan              Asia    16    39
Albania                Europe     1     0
Algeria                Africa    80    67
American Samoa        Oceania     0     1
Andorra                Europe     0     0
Andorra         North America    50    60

In [17]:
df_OdName.loc[["Andorra", "Algeria"]]  #Need to Provide Index Values as a List

              AreaName  1980  1981
OdName
Andorra         Europe     0     0
Andorra  North America    50    60
Algeria         Africa    80    67

####  Search Spcific [ROW, COLUMN] value

In [18]:
df_OdName

                     AreaName  1980  1981
OdName
Afghanistan              Asia    16    39
Albania                Europe     1     0
Algeria                Africa    80    67
American Samoa        Oceania     0     1
Andorra                Europe     0     0
Andorra         North America    50    60

In [20]:
df_OdName.loc["Algeria",1980]   #[ROW, COLUMN]

80

In [21]:
df_OdName.loc[["Algeria"], [1980]]  #If ROW, COL input provide as alist it will return DataFrame

         1980
OdName
Algeria    80

In [22]:
df_OdName.loc[["Algeria", "Albania"], 1980]

OdName
Algeria    80
Albania     1
Name: 1980, dtype: int64

In [25]:
df_OdName.loc[["Algeria", "Albania"], [1980, 1981]]  #Multiple Rows and COlumns need to provide as a List

         1980  1981
OdName
Algeria    80    67
Albania     1     0

#### Using Range

In [30]:
df_new

           OdName       AreaName  1980  1981
0     Afghanistan           Asia    16    39
1         Albania         Europe     1     0
2         Algeria         Africa    80    67
3  American Samoa        Oceania     0     1
4         Andorra         Europe     0     0
5         Andorra  North America    50    60

In [35]:
df.loc[0 : 4, ["AreaName", 1981]]  #List same as Python list range

  AreaName  1981
0     Asia    39
1   Europe     0
2   Africa    67
3  Oceania     1
4   Europe     0